Template_Cases/HydralloyC5_Absorption/0/metalArea/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/metalArea";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    "(tankWall.*)"
    {
        type            zeroGradient;
    }

    "(front|back)"
    {
        type            wedge;
    }

    metalArea_to_hydrogenArea
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
