Template_Cases/HydralloyC5_Absorption/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/hydrogenArea";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;
    // div(phi,T)          bounded Gauss upwind;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}


// ************************************************************************* //
